In [7]:

import xlrd
import pymysql
import math
import pandas as pd
from sqlalchemy import create_engine

In [24]:
conn = pymysql.connect(
        host='localhost', 
        user='root', 
        passwd = 'fc117108',
        db='music',
        port=3306,
        charset='utf8'
        )
cur = conn.cursor()
cur.execute("SET NAMES utf8")

sql_cmd = "SELECT  lyric_id,author_name FROM music.Excel21;"
df = pd.read_sql(sql_cmd,conn)
df

/usr/local/lib/python3.7/site-packages/pymysql/cursors.py:170: Warning: (3719, "'utf8' is currently an alias for the character set UTF8MB3, but will be an alias for UTF8MB4 in a future release. Please consider using UTF8MB4 in order to be unambiguous.")
  result = self._query(query)

        lyric_id author_name
0         100000         張洪量
1         100042         張洪量
2         131843          小軒
3          84942          小軒
4         125851          未知
...          ...         ...
261230    293084          未知
261231    293085         口香糖
261232    293086          未知
261233    293087          小凱
261234    293088          未知

[261235 rows x 2 columns]

In [31]:
df['author_name']=[l.strip() for l in df.author_name]

In [45]:
df[df['author_name']=='元欽、唐林鈺(Hmp)']

       lyric_id  author_name
3311     253202  元欽、唐林鈺(Hmp)
27459    253211  元欽、唐林鈺(Hmp)

In [46]:
sql_cmd = "SELECT  * FROM mojim.author;"
df2 = pd.read_sql(sql_cmd,conn)
df2

       author_id                                        author_name
0              1                                                張洪量
1              2                                                 小軒
2              3                                                 未知
3              4                                                 思安
4              5                                                許常德
...          ...                                                ...
31275      31276                                             おぐらあすか
31276      31277                                               西岡水朗
31277      31278  Selina Tseng 曾麗婕 、Roland Lim 林添明 & Andrew Lui 雷振光
31278      31279                                            莫榮烽 楊恭偉
31279      31280                                                口香糖

[31280 rows x 2 columns]

In [33]:
df2['author_name']=[l.strip() for l in df2.author_name]

In [48]:
df2[df2['author_name']=='元欽、唐林鈺(Hmp)']

Empty DataFrame
Columns: [author_id, author_name]
Index: []

In [42]:
df[df['lyric_id']==253202]

      lyric_id  author_name
3311    253202  元欽、唐林鈺(Hmp)

In [38]:
df3=pd.merge(df,df2,on='author_name',how='left')
df3[df3['lyric_id']==28622]

        lyric_id author_name  author_id
318024     28622         馬金星    14677.0

In [41]:
# df3
df4=df3[['lyric_id','author_id']]
df4
df4[df4['lyric_id']==253202]

      lyric_id  author_id
4533    253202        NaN

In [40]:
conn = create_engine('mysql+pymysql://root:fc117108@localhost:3306/mojim',encoding='utf8')  

pd.io.sql.to_sql(df4, "lyric_author_relation", conn,index=False, if_exists='replace')